#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_iam_policy.bastion_policy: Refreshing state... [id=arn:aws:iam::767398122881:policy/rs-bastion-policy-dev]
data.aws_ami.ubuntu: Reading...
aws_iam_role.controlplane_role: Refreshing state... [id=rs-controlplane-role-dev]
aws_kms_key.cloudwatch: Refreshing state... [id=f85d5ea0-a72d-48ce-a08e-0b3a67dc9cf2]
aws_iam_role.vpc_flow_logs_role: Refreshing state... [id=rs-vpc-flow-logs-role-dev]
aws_iam_role.bastion_role: Refreshing state... [id=rs-bastion-role-dev]
aws_eip.nat: Refreshing state... [id=eipalloc-0d8a3d521d9c15237]
aws_iam_policy.controlplane_policy: Refreshing state... [id=arn:aws:iam::767398122881:policy/rs-controlplane-policy-dev]
aws_iam_policy.worker_policy: Refreshing state... [id=arn:aws:iam::767398122881:policy/rs-worker-policy-dev]
aws_iam_role.worker_role: Refreshing state... [id=rs-worker-role-dev]
aws_vpc.main: Refreshing state... [id=vpc-0336e16edf8820ae8]
aws_cloudwatch_log_group.vpc_flow_logs: Refreshing state... [id=/aws/vpc/flow-logs]
aws_iam_role_policy_attachment.worker_policy_attach: Refreshing state... [id=rs-worker-role-dev-20250704134121242800000003]
aws_iam_instance_profile.worker_profile: Refreshing state... [id=rs-worker-instance-profile-dev]
aws_iam_role_policy_attachment.bastion_policy_attach: Refreshing state... [id=rs-bastion-role-dev-20250704134121193200000002]
aws_iam_instance_profile.bastion_profile: Refreshing state... [id=rs-bastion-instance-profile-dev]
aws_iam_role_policy_attachment.vpc_flow_logs_policy: Refreshing state... [id=rs-vpc-flow-logs-role-dev-20250704134121298000000004]
aws_iam_instance_profile.controlplane_profile: Refreshing state... [id=rs-controlplane-instance-profile-dev]
aws_iam_role_policy_attachment.controlplane_policy_attach: Refreshing state... [id=rs-controlplane-role-dev-20250704134121164000000001]
data.aws_ami.ubuntu: Read complete after 1s [id=ami-03b371d239dfe4af4]
aws_internet_gateway.igw: Refreshing state... [id=igw-03cb509fe69174f12]
aws_subnet.public[0]: Refreshing state... [id=subnet-0f607a2400df64340]
aws_security_group.vm_private_sg: Refreshing state... [id=sg-096543e2a3e21a37a]
aws_subnet.private[1]: Refreshing state... [id=subnet-0fa4f12e43fef8a34]
aws_subnet.public[1]: Refreshing state... [id=subnet-0ea55eb15a5ee61fc]
aws_security_group.bastion_sg: Refreshing state... [id=sg-0c8b29e3d6f0181db]
aws_subnet.private[0]: Refreshing state... [id=subnet-001386dcbbc424f34]
aws_flow_log.vpc_flow: Refreshing state... [id=fl-07c380b03669b2c52]
aws_security_group.vm_public_sg: Refreshing state... [id=sg-03a5542bb1b76e452]
aws_route_table.public: Refreshing state... [id=rtb-0ab68ab7620e1c6e4]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-063292c3122408e42]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-08cd93bcd91f932fa]
aws_nat_gateway.natgw: Refreshing state... [id=nat-0adc780e48bff1bbf]
aws_network_acl.public: Refreshing state... [id=acl-03db229a2d2e179c1]
aws_network_acl.private: Refreshing state... [id=acl-036965f1c09afddd4]
aws_instance.k3s_control_plane: Refreshing state... [id=i-01f3bbb653c3db6d0]
aws_route_table.private: Refreshing state... [id=rtb-0ef4efba0bb5eb8a1]
aws_network_acl_rule.public_outbound_all: Refreshing state... [id=nacl-430158826]
aws_network_acl_rule.public_inbound_all: Refreshing state... [id=nacl-454585160]
aws_network_acl_rule.private_inbound_ephemeral: Refreshing state... [id=nacl-1643690214]
aws_network_acl_rule.private_inbound_all_vpc: Refreshing state... [id=nacl-4189195802]
aws_network_acl_rule.private_outbound_all: Refreshing state... [id=nacl-196932899]
aws_network_acl_rule.private_inbound_icmp_vpc: Refreshing state... [id=nacl-556755423]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0d7eaf33e1d1673ae]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0ba8fcf1f3c6b6777]
aws_instance.k3s_worker: Refreshing state... [id=i-0465afa98f4f604b6]
aws_instance.bastion: Refreshing state... [id=i-0688d8fd189183071]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # aws_instance.bastion will be updated in-place
  ~ resource "aws_instance" "bastion" {
        id                                   = "i-0688d8fd189183071"
      ~ public_dns                           = "ec2-51-20-137-119.eu-north-1.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "51.20.137.119" -> (known after apply)
        tags                                 = {
            "Name" = "rs-bastion-dev"
            "Role" = "bastion"
        }
      ~ user_data                            = "203d8599319e064014d1b94e0e799ff982294b97" -> "c00ca669ea099420500093be490aab52a0d1c70c"
        # (37 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # aws_security_group.bastion_sg will be updated in-place
  ~ resource "aws_security_group" "bastion_sg" {
        id                     = "sg-0c8b29e3d6f0181db"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow Jenkins from trusted CIDR"
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8080
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow kubernetes API from trusted CIDR"
              + from_port        = 6443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 6443
            },
            # (1 unchanged element hidden)
        ]
        name                   = "rs-sg-bastion-dev"
        tags                   = {
            "Name" = "rs-sg-bastion-dev"
        }
        # (8 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  ~ bastion_public_ip            = "51.20.137.119" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: output.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "output.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @isbelevtsov, Action: `pull_request`, Working Directory: `task_4/project/terraform`, Workflow: `Terraform Plan and Apply`*